# \> SELECT (1/2)
Сделайте запрос на все колонки из таблицы `user`. Для этого может понадобиться взять user в кавычки, вот так: `"user"` - чтобы PostgreSQL не спутал ее со своей встроенной таблицей `user`, где он ведет учет всех пользователей.

Напишите через пробел, с какого id начинаются записи и какой город у самого первого ID (на английском)

In [11]:
import pandas as pd
from db_con import connection

sql_query = """
    select * from "user"
"""
df = pd.read_sql(
    sql_query,
    con=connection
)

df.head()

    id  gender  age country               city  exp_group       os source
0  200       1   34  Russia          Degtyarsk          3  Android    ads
1  201       0   37  Russia             Abakan          0  Android    ads
2  202       1   17  Russia           Smolensk          4  Android    ads
3  203       0   18  Russia             Moscow          1      iOS    ads
4  204       0   36  Russia  Anzhero-Sudzhensk          3  Android    ads

In [14]:
df.iloc[0]['id']

np.int64(200)

In [15]:
df.iloc[0]['city']

'Degtyarsk'